## 1. Series의 Type

In [1]:
# 데이터프레임 로드
import pandas as pd
df = pd.read_csv('C:/Users/chunc/Desktop/취업캠프/python/python/korean-idol.csv')
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

### 1-1. type 확인하기

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   이름       15 non-null     object
 1   그룹       14 non-null     object
 2   소속사      15 non-null     object
 3   성별       15 non-null     object
 4   생년월일     15 non-null     object
 5   키        13 non-null     float64
 6   혈액형      15 non-null     object
 7   브랜드평판지수  15 non-null     int64
dtypes: float64(1), int64(1), object(6)
memory usage: 1.1+ KB

* object: 일반 문자열 타입
* float: 실수
* int: 정수
* category: 카테고리
* datetime: 시간

### 1-2. type 변환하기

* type 변환을 위해서는 **astype**이라는 메서드를 사용한다.

키 column은 현재 float으로 명시되어있는데, 이것을 정수형인 int type으로 변경해 본다.

In [3]:
df['키'].dtypes

dtype('float64')

In [4]:
df['키']

0     173.6
1     177.0
2     180.0
3     178.0
4     162.1
5     178.0
6     182.3
7       NaN
8     179.2
9     167.1
10      NaN
11    183.0
12    175.0
13    176.0
14    174.0
Name: 키, dtype: float64

In [5]:
# NaN값이 있는경우 오류가 나기 떄문에 fillna를 사용하여 빈값을 채워주고 실행
df['키'].fillna(df['키'].mean(), inplace = True)

In [6]:
# '키'컬럼이 float64 -> int타입으로 변경할때
# astype()함수는 데이터 타입을 변경
# 소수점 미만을 절삭
df['키'].astype(int)

0     173
1     177
2     180
3     178
4     162
5     178
6     182
7     175
8     179
9     167
10    175
11    183
12    175
13    176
14    174
Name: 키, dtype: int32

In [7]:
# 문자형으로 바꿔주기
df['키'].astype(object)

0          173.6
1          177.0
2          180.0
3          178.0
4          162.1
5          178.0
6          182.3
7     175.792308
8          179.2
9          167.1
10    175.792308
11         183.0
12         175.0
13         176.0
14         174.0
Name: 키, dtype: object

In [8]:
# float형으로 다시 바꿔주기
# fillna(df['키'].mean()의 값이 소수6번째자리까지 표현되어서 실수형 표기방식이 커진것dlek
df['키'].astype(float)

0     173.600000
1     177.000000
2     180.000000
3     178.000000
4     162.100000
5     178.000000
6     182.300000
7     175.792308
8     179.200000
9     167.100000
10    175.792308
11    183.000000
12    175.000000
13    176.000000
14    174.000000
Name: 키, dtype: float64

### 1-3. 날짜 변환하기(datetime 타입)

* 날자를 변환하기 위해서는 판다스 to_datetime이라는 메소드 사용한다.

현재 날짜 column은 dtype이 object(문자열)타입으로 되어 있다.

In [9]:
df['생년월일']

0     1995-10-13
1     1988-08-18
2     1996-12-10
3     1995-12-30
4     1995-07-23
5     1997-09-01
6     1995-08-09
7     1998-08-26
8     1992-12-04
9     1994-03-22
10    1989-03-09
11    1997-03-30
12    1995-07-21
13    1995-06-08
14    1993-03-09
Name: 생년월일, dtype: object

In [10]:
df['생년월일'][0]

'1995-10-13'

In [11]:
# datetype바꾸기
# 민약 df['생년월일'].to_datetime()으로 실행할 경우, 오류 발생
pd.to_datetime(df['생년월일'])

0    1995-10-13
1    1988-08-18
2    1996-12-10
3    1995-12-30
4    1995-07-23
5    1997-09-01
6    1995-08-09
7    1998-08-26
8    1992-12-04
9    1994-03-22
10   1989-03-09
11   1997-03-30
12   1995-07-21
13   1995-06-08
14   1993-03-09
Name: 생년월일, dtype: datetime64[ns]

변환된 것을 **df['날짜'] column에 다시 대입**을 해줘야 정상적으로 변환된 값이 들어 갑니다.

In [13]:
# 변환된 값을 다시 대입해주어야 한다
df['생년월일'] = pd.to_datetime(df['생년월일'])
df['생년월일']

0    1995-10-13
1    1988-08-18
2    1996-12-10
3    1995-12-30
4    1995-07-23
5    1997-09-01
6    1995-08-09
7    1998-08-26
8    1992-12-04
9    1994-03-22
10   1989-03-09
11   1997-03-30
12   1995-07-21
13   1995-06-08
14   1993-03-09
Name: 생년월일, dtype: datetime64[ns]

#### python에서 일반적으로 문자열 형태로 표기할때

'1997-07-21', '1997.07.21'

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   이름       15 non-null     object
 1   그룹       14 non-null     object
 2   소속사      15 non-null     object
 3   성별       15 non-null     object
 4   생년월일     15 non-null     datetime64[ns]
 5   키        15 non-null     float64
 6   혈액형      15 non-null     object
 7   브랜드평판지수  15 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 1.1+ KB

datetime 타입으로 변환해준 중요한 이유
* 매우손쉽게 월, 일, 요일 등등의 날짜 정보를 세부적으로 추출해낼 수 있다.
* datetime의 약어인 'dt'에는 다양한 정보들을 제공해 준다.

In [15]:
df.head()

     이름     그룹  소속사  성별       생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자 1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자 1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자 1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자 1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자 1995-07-23  162.1   A   7650928

In [18]:
# df['생년월일']의 데이터타입이 datetime인 경우에 가능
# 월요일: 0, 일요일: 6
# 날짜의 요일들 확인 -> 0 ~ 6사이의 숫자로 표시
df['생년월일'].dt.dayofweek

0     4
1     3
2     1
3     5
4     6
5     0
6     2
7     2
8     4
9     1
10    3
11    6
12    4
13    3
14    1
Name: 생년월일, dtype: int64

**월요일: 0 화요일: 1, 수요일: 2, 목요일: 3, 금요일: 4, 토요일: 5, 일요일: 6**

In [19]:
df['생년월일'].dt.year

0     1995
1     1988
2     1996
3     1995
4     1995
5     1997
6     1995
7     1998
8     1992
9     1994
10    1989
11    1997
12    1995
13    1995
14    1993
Name: 생년월일, dtype: int64

In [21]:
df[df['생년월일'].dt.year == 1995]

    이름     그룹   소속사  성별       생년월일      키 혈액형   브랜드평판지수
0   지민  방탄소년단   빅히트  남자 1995-10-13  173.6   A  10523260
3    뷔  방탄소년단   빅히트  남자 1995-12-30  178.0  AB   8073501
4   화사    마마무   RBW  여자 1995-07-23  162.1   A   7650928
6   민현   뉴이스트  플레디스  남자 1995-08-09  182.3   O   4989792
12  백호   뉴이스트  플레디스  남자 1995-07-21  175.0  AB   3301654
13  JR   뉴이스트  플레디스  남자 1995-06-08  176.0   O   3274137

In [22]:
df['생년월일'].dt.month

0     10
1      8
2     12
3     12
4      7
5      9
6      8
7      8
8     12
9      3
10     3
11     3
12     7
13     6
14     3
Name: 생년월일, dtype: int64

In [23]:
df['생년월일'].dt.day

0     13
1     18
2     10
3     30
4     23
5      1
6      9
7     26
8      4
9     22
10     9
11    30
12    21
13     8
14     9
Name: 생년월일, dtype: int64

In [24]:
df['생년월일'].dt.hour

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
Name: 생년월일, dtype: int64

In [25]:
df['생년월일'].dt.minute

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
Name: 생년월일, dtype: int64

In [26]:
df['생년월일'].dt.second

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
Name: 생년월일, dtype: int64

In [30]:
df['생일_년'] = df['생년월일'].dt.year
df['생일_월'] = df['생년월일'].dt.month
df['생일_일'] = df['생년월일'].dt.day

In [31]:
df.head()

     이름     그룹  소속사  성별       생년월일      키 혈액형   브랜드평판지수  생일_년  생일_월  생일_일
0    지민  방탄소년단  빅히트  남자 1995-10-13  173.6   A  10523260  1995    10    13
1  지드래곤     빅뱅   YG  남자 1988-08-18  177.0   A   9916947  1988     8    18
2  강다니엘    NaN  커넥트  남자 1996-12-10  180.0   A   8273745  1996    12    10
3     뷔  방탄소년단  빅히트  남자 1995-12-30  178.0  AB   8073501  1995    12    30
4    화사    마마무  RBW  여자 1995-07-23  162.1   A   7650928  1995     7    23

## 2. apply함수

In [32]:
# 데이터프레임 로드
import pandas as pd
df = pd.read_csv('C:/Users/chunc/Desktop/취업캠프/python/python/korean-idol.csv')
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

apply는 Series나 DataFrame에 좀 더 구체적인 로직을 적용하고 싶은 경우 활용한다.
* apply를 적용하기 위해서는 함수가 먼저 정의되어야 한다.
* apply는 정의한 로직 함수를 인자로 넘겨준다.

In [33]:
# '성별' 컬럼의 '남자', '여자'를 1과 0으로 변경
df.loc[df['성별'] == '남자', '성별'] = 1
df.loc[df['성별'] == '여자', '성별'] = 0

In [35]:
df

      이름     그룹      소속사 성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  1  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  1  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  1  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  1  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  0  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  1  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  1  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  0  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  1  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  1  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  0  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  1  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  1  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  1  1995-06-08  176.0   O   3274137
14    슈가  방탄소년단      빅히트  1  1993-03-09  174.0   O   2925442

### 2-1. 남자/여자 문자열 데이터로 구성된 '성별' column을 1 / 0 으로 바꾸기

In [43]:
# 파일 불러오기
df = pd.read_csv('C:/Users/chunc/Desktop/취업캠프/python-20230220T004050Z-001/python/korean-idol.csv')
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [37]:
# 방법1: 기존 함수 사용
# 반드시 return값이 존재해야 함
# 먼저 apply에 활용할 함수 정의
def male_or_female(x):
    if x == '남자':
        return 1
    elif x == '여자':
        return 0

In [38]:
# python에서 .map()과 유사(python함수)
# apply()함수는 pandas의 데이터타입에 최적화된 함수
df['성별_NEW'] = df['성별'].apply(male_or_female)

In [39]:
df

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수  성별_NEW
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260       1
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947       1
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745       1
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501       1
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928       0
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335       1
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792       1
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615       0
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308       1
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489       1
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661       0
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027       1
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654       1
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137       1
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442       1

람다 함수 생성하기

In [41]:
# 람다함수 예1
add = lambda a,b: a+b
result = add(3, 4)
print(result)

7

In [42]:
# 람다함수 예2
score = lambda x:'A등급' if x >= 80 else 'B등급'

In [44]:
# 람다함수를 사용한 경우
male_or_female = lambda x:1 if x == '남자' else 0
df['성별_NEW'] = df['성별'].apply(male_or_female)

In [45]:
df

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수  성별_NEW
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260       1
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947       1
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745       1
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501       1
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928       0
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335       1
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792       1
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615       0
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308       1
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489       1
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661       0
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027       1
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654       1
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137       1
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442       1

## 3. lambda함수의 적용

* lambda를 1줄로 작성하는 간단 함수식
* return을 별도로 명시하지 않는다

In [46]:
f = lambda x:1 if x == '남자' else 0

해당 함수를 기존에 정의한 데이터 프레임중 특정 컬럼에 대해 적용하려면 다음과 같이 적용하면 된다.

* 데이터프레임['컬럼'].apply(함수명)

In [47]:
df['성별'].apply(f)

0     1
1     1
2     1
3     1
4     0
5     1
6     1
7     0
8     1
9     1
10    0
11    1
12    1
13    1
14    1
Name: 성별, dtype: int64

In [48]:
df['키/2'] = df['키'].apply(lambda x:x / 2)

In [49]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수  성별_NEW    키/2
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260       1  86.80
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947       1  88.50
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745       1  90.00
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501       1  89.00
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928       0  81.05

In [50]:
df['키'].apply(lambda x: x**2)

0     30136.96
1     31329.00
2     32400.00
3     31684.00
4     26276.41
5     31684.00
6     33233.29
7          NaN
8     32112.64
9     27922.41
10         NaN
11    33489.00
12    30625.00
13    30976.00
14    30276.00
Name: 키, dtype: float64

apply에 함수식을 만들어서 적용해주것과 동일하기 때문에, 복잡한 조건식은 함수로 간단한 계산식은 lambda로 적용할 수 있다.

## 4. map - 값을 매핑

In [51]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수  성별_NEW    키/2
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260       1  86.80
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947       1  88.50
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745       1  90.00
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501       1  89.00
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928       0  81.05

In [53]:
# python dict의 정의로
my_map = {
    '남자': 1,
    '여자': 0
}

In [54]:
# map이라는 함수를 사용할 때는 dict{} 하나가 정의되어있어야 하고
# .map({dict})
df['성별'].map(my_map)

0     1
1     1
2     1
3     1
4     0
5     1
6     1
7     0
8     1
9     1
10    0
11    1
12    1
13    1
14    1
Name: 성별, dtype: int64

In [55]:
my_map = {
    '남자': 'male',
    '여자': 'female'
}

In [56]:
df['성별'].map(my_map)

0       male
1       male
2       male
3       male
4     female
5       male
6       male
7     female
8       male
9       male
10    female
11      male
12      male
13      male
14      male
Name: 성별, dtype: object

### applyTest데이터로 람다함수 연습하기

In [1]:
import pandas as pd
csvFile = 'C:/Users/chunc/Desktop/취업캠프/python/python/pandas/pandas/applyTest.csv'

In [2]:
df = pd.read_csv(csvFile)
df

   op1  op2  result
0    3    5     NaN
1    7    6     NaN
2    6    7     NaN
3    4   98     NaN
4    3    8     NaN
5    1    6     NaN

In [3]:
# result 컬럼 삭제
df.drop('result', axis = 1, inplace = True)
df

   op1  op2
0    3    5
1    7    6
2    6    7
3    4   98
4    3    8
5    1    6

In [4]:
# op1 * op2 = result계산하는 람다함수 생성, apply와 map함수 사용해서 'result'컬럼에 저장하기
# 방법1
df['result'] = df.apply(lambda x: x['op1'] * x['op2'], axis = 1)
df

   op1  op2  result
0    3    5      15
1    7    6      42
2    6    7      42
3    4   98     392
4    3    8      24
5    1    6       6

In [5]:
# 방법2
my_sub = lambda x: x['op1'] - x['op2']
df['result'] = df.apply(my_sub, axis = 1)
df

   op1  op2  result
0    3    5      -2
1    7    6       1
2    6    7      -1
3    4   98     -94
4    3    8      -5
5    1    6      -5

In [7]:
# 컬럼명이 없는데이터는 첫번째 value값이 컬럼명으로 지정될 때도 있다 -> header = None
# 아래의 경우는 파일자체에서 수정했다
csvFile1 = 'C:/Users/chunc/Desktop/취업캠프/python/python/pandas/pandas/applyTest2.csv'
df2 = pd.read_csv(csvFile1)
df2

      1    2   3     4
0     I  am    a   boy
1   You  are  a   girl
2  This   is  a    pen

In [8]:
# 1, 2, 3, 4의 컬럼을 더해서 하나의 문자열로 만들기
# apply, 일반함수 또는 람다함수 사용
# strip()를 이용하여 문자열사이에 들어간 공백 제거
# 인덱싱 방법1
my_add = lambda x: x['1'].strip() + ' ' + x['2'].strip() + ' ' + x['3'].strip() + ' ' +x['4'].strip()
df2['result'] = df2.apply(my_add, axis = 1)

In [9]:
df2

      1    2   3     4          result
0     I  am    a   boy      I am a boy
1   You  are  a   girl  You are a girl
2  This   is  a    pen   This is a pen

In [10]:
# 인덱싱 방법2
my_add = lambda x: x[0].strip() + ' ' + x[1].strip() + ' ' + x[2].strip() + ' ' + x[3].strip()
df2['result'] = df2.apply(my_add, axis = 1)
df2

      1    2   3     4          result
0     I  am    a   boy      I am a boy
1   You  are  a   girl  You are a girl
2  This   is  a    pen   This is a pen

In [11]:
# 데이터프레임에서 참조하고 싶은 칼럼만 추출하고싶을때
# 데이터프레임의 '1', '2' 칼럼을 리스트에 넣고 실행
col = ['1', '2']
df2[col].apply(lambda x: print(x), axis = 1)

1      I
2    am
Name: 0, dtype: object
1    You
2    are
Name: 1, dtype: object
1    This
2      is
Name: 2, dtype: object

0    None
1    None
2    None
dtype: object

## 5. Column과 Column간 연산(+, -, *, /, %)

### 예제 DataFrame 생성

In [13]:
df = pd.DataFrame({'통계': [60, 70, 80, 85, 75], '미술': [50, 55, 80, 100, 95], '체육': [70, 65, 50, 95, 100] })
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [14]:
type(df['통계'])

pandas.core.series.Series

In [15]:
# 데이터의 타입 먼저 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   통계      5 non-null      int64
 1   미술      5 non-null      int64
 2   체육      5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [16]:
df['통계'] + df['미술'] + df['체육']

0    180
1    190
2    210
3    280
4    270
dtype: int64

In [17]:
df['통계'] - df['미술']

0    10
1    15
2     0
3   -15
4   -20
dtype: int64

In [18]:
df['통계'] * df['미술']

0    3000
1    3850
2    6400
3    8500
4    7125
dtype: int64

In [19]:
df['통계'] / df['미술']

0    1.200000
1    1.272727
2    1.000000
3    0.850000
4    0.789474
dtype: float64

In [20]:
df['통계'] % df['미술']

0    10
1    15
2     0
3    85
4    75
dtype: int64

## 6. Column과 숫자 간 연산(+, -, *, /, %)

In [21]:
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [22]:
df['통계'] + 10

0    70
1    80
2    90
3    95
4    85
Name: 통계, dtype: int64

In [23]:
df['통계'] - 10

0    50
1    60
2    70
3    75
4    65
Name: 통계, dtype: int64

In [24]:
df['통계'] * 10

0    600
1    700
2    800
3    850
4    750
Name: 통계, dtype: int64

In [25]:
df['통계'] / 10

0    6.0
1    7.0
2    8.0
3    8.5
4    7.5
Name: 통계, dtype: float64

In [26]:
df['통계'] % 10

0    0
1    0
2    0
3    5
4    5
Name: 통계, dtype: int64

## 7. 복합 연산

In [27]:
df = pd.DataFrame({'통계': [60, 70, 80, 85, 75], '미술': [50, 55, 80, 100, 95], '체육': [70, 65, 50, 95, 100] })
df

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [28]:
df['통계미술합계'] = df['통계'] + df['미술'] + 10
df

   통계   미술   체육  통계미술합계
0  60   50   70     120
1  70   55   65     135
2  80   80   50     170
3  85  100   95     195
4  75   95  100     180

In [29]:
df['통계'] + df['미술'] - df['체육']

0     40
1     60
2    110
3     90
4     70
dtype: int64

In [30]:
df

   통계   미술   체육  통계미술합계
0  60   50   70     120
1  70   55   65     135
2  80   80   50     170
3  85  100   95     195
4  75   95  100     180

## 8. mean(), sum()을 axis기준으로 연산

In [31]:
# 컬럼별 평균값 (세로로 더한것의 평균)
df.mean(axis = 0)

통계         74.0
미술         76.0
체육         76.0
통계미술합계    160.0
dtype: float64

In [32]:
# 행별 평균값 (가로로 더한것의 평균)
df.mean(axis = 1)

0     75.00
1     81.25
2     95.00
3    118.75
4    112.50
dtype: float64

In [33]:
# 컬럼별 합산값 (세로로 더한것)
df.sum(axis = 0)

통계        370
미술        380
체육        380
통계미술합계    800
dtype: int64

In [34]:
# 행별 합산값 (가로로 더한것)
df.sum(axis = 1)

0    300
1    325
2    380
3    475
4    450
dtype: int64

## 9. NaN값이 존재할 경우의 연산

In [36]:
import numpy as np
df = pd.DataFrame({'통계': [60, 70, np.nan , 85, 75], '미술': [50, np.nan , 80, 100, 95], '체육': [70, 65, 50, np.nan , 100] })
df

     통계     미술     체육
0  60.0   50.0   70.0
1  70.0    NaN   65.0
2   NaN   80.0   50.0
3  85.0  100.0    NaN
4  75.0   95.0  100.0

In [37]:
df['통계'] / 2

0    30.0
1    35.0
2     NaN
3    42.5
4    37.5
Name: 통계, dtype: float64

In [38]:
1000 / df['통계']

0    16.666667
1    14.285714
2          NaN
3    11.764706
4    13.333333
Name: 통계, dtype: float64

In [39]:
df['통계'] / np.nan

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: 통계, dtype: float64

In [40]:
np.nan / df['통계']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: 통계, dtype: float64

## 10. DataFrame 과 DataFrame간 연산

In [41]:
df1 = pd.DataFrame({'통계': [60, 70, 80, 85, 75], '미술': [50, 55, 80, 100, 95], '체육': [70, 65, 50, 95, 100] })

In [42]:
df2 = pd.DataFrame({'통계': ['good', 'bad', 'ok' , 'good', 'ok'], '미술': [50, 60 , 80, 100, 95], '체육': [70, 65, 50, 70 , 100] })

In [43]:
df1

   통계   미술   체육
0  60   50   70
1  70   55   65
2  80   80   50
3  85  100   95
4  75   95  100

In [44]:
df2

     통계   미술   체육
0  good   50   70
1   bad   60   65
2    ok   80   50
3  good  100   70
4    ok   95  100

In [45]:
df1 + df2

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [46]:
# 문자열이 포함된 DataFrame의 브로드캐스팅 연산
df1 + 10

   통계   미술   체육
0  70   60   80
1  80   65   75
2  90   90   60
3  95  110  105
4  85  105  110

In [47]:
df2 + 10

TypeError: can only concatenate str (not "int") to str

In [48]:
# 문자열을 제외하고 컬럼별 덧셈을 하고자 할 때
col = ['미술', '체육']
df2[col] + 10

    미술   체육
0   60   80
1   70   75
2   90   60
3  110   80
4  105  110

column의 순서가 바뀌어 있는 경우

In [49]:
df1 = pd.DataFrame({'미술': [10, 20, 30, 40, 50], '통계':[60, 70, 80, 90, 100] })
df2 = pd.DataFrame({'통계': [10, 20, 30, 40, 50], '미술': [60, 70, 80, 90, 100] })

In [50]:
df1

   미술   통계
0  10   60
1  20   70
2  30   80
3  40   90
4  50  100

In [51]:
df2

   통계   미술
0  10   60
1  20   70
2  30   80
3  40   90
4  50  100

In [52]:
# 순서가 바뀌어도 column별 덧셈이 정상적으로 수행해진다
df1 + df2

    미술   통계
0   70   70
1   90   90
2  110  110
3  130  130
4  150  150

행의갯수가 다른경우

In [53]:
df1 = pd.DataFrame({'미술': [10, 20, 30, 40, 50, 60], '통계':[60, 70, 80, 90, 100, 110] })
df2 = pd.DataFrame({'통계': [10, 20, 30, 40, 50], '미술': [60, 70, 80, 90, 100] })

In [54]:
df1 + df2

      미술     통계
0   70.0   70.0
1   90.0   90.0
2  110.0  110.0
3  130.0  130.0
4  150.0  150.0
5    NaN    NaN

위와 같이 행의 개수가 다른부분만 NaN값이 나타난다.